# Example
#
# tap "homebrew/cask"
# tap "telemachus/brew", "https://telemachus@bitbucket.org/telemachus/brew.git", pin: true
# brew "imagemagick"
# brew "mysql@5.6", restart_service: true, link: true, conflicts_with: ["mysql"]
# brew "emacs", args: ["with-cocoa", "with-gnutls"]
# cask "google-chrome"
# cask "java" unless system "/usr/libexec/java_home --failfast"
# cask "firefox", args: { appdir: "~/my-apps/Applications" }
# mas "1Password", id: 443987910

tap "jzaleski/homebrew-jzaleski"                  # support for apg
tap "lokalise/cli-2"
tap "homebrew/cask-fonts"                         # support for fonts
tap "colindean/fonts-nonfree"                     # Calibri, Cambria, ...
tap "github/gh"                                   # Github CLI
tap "romkatv/powerlevel10k"
tap "Blackjacx/homebrew-formulae"                 # App Store Connect API client written in Swift
tap "getsentry/tools"                             # to install sentry CLI
tap "chargepoint/xcparse"                         # to install xcparse
tap "peripheryapp/periphery"                      # to install periphery
tap "julien-cpsn/atac"                            # to install atag
tap "jesseduffield/lazygit"                       # to install lazygit

# Xcode first since it is required by applications below, e.g. xcparse
# mas "xcode", id: 497799835 # This will download Xcode even if it is installed - which takes a lot of time
# mas "tweetbot", id: 557168941
# mas "gifski", id: 1351639930

brew "ag"                                         # 🔥 code-searching tool similar to ack, but faster
brew "alacritty"                                  # A cross-platform, OpenGL terminal emulator.
brew "apg"                                        # Generate strong passwords
brew "aria2"                                      # 🔥 download manager that supports segmented downloads
brew "asc"                                        # App Store Connect API client written in Swift
brew "asciinema"                                  # Terminal session recorder
brew "atac"                                       # A simple API client (postman like) in your terminal
#brew "atuin"                                     # SQLlite history plugin
brew "awscli"                                     # The command line frontend for Amazon Web Services
brew "bash"                                       # The bash shell
brew "bat"                                        # A cat clone with wings.
brew "bitwarden-cli"                              # Fully-featured tool for accessing and managing your Bitwarden Vault • Used to auto-export credentials
brew "btop"                                       # 🔥 A monitor of resources
brew "ccat"                                       # 🔥 Colorizing cat
brew "cloc"                                       # lines of code counter
brew "cmatrix"                                    # Terminal based "The Matrix" like implementation
brew "coreutils"
brew "curl"
brew "direnv"                                     # 🔥 .envrc file loader
brew "doxygen"
brew "entr"                                       # Run arbitrary commands when files change
brew "eza"                                        # Modern `ls` ... `exa` replacement
brew "fd"                                         # Drop in replacement for find
brew "ffmpeg"
brew "figlet"                                     # making large letters out of ordinary text
brew "firebase-cli"                               # automating Firebase
brew "fx"                                         # 🔥 Interactive terminal JSON viewer & processor
# brew "fzf"                                        # A command-line fuzzy finder | installed using "mise en place"
brew "gh"
brew "ghostscript"                                # needed inconjunction with imagemagick to convert pdf > png (conversion of PDF app icons from UX to PNG automatically)
brew "git"                                        # distributed version-control system for tracking changes in source code during software development
brew "git-extras"
brew "git-flow"
brew "github-markdown-toc"
brew "gource"                                     # software version control visualization
brew "htop"
brew "httpie"
brew "imagemagick"                                # Use ImageMagick® to create, edit, compose, or convert digital images.
brew "irssi"
brew "lazygit"                                    # simple terminal UI for git commands
brew "lokalise2"                                  # tool for for mobile localization cloud platform (new version)
brew "mas"                                        # installs Mac App Store apps
brew "midnight-commander"
brew "mint"                                       # 🔥 dependency manager for swift packages
brew "mitmproxy"                                  # 🔥 Intercepting Network Traffic
# brew "mplayer"                                  # free and open-source media player | currently not used
brew "nano"
brew "ncdu"                                       # Disk usage analyzer
brew "nmap"                                       # "Network Mapper" is an open source tool for network exploration and security auditing.
brew "node"
brew "npm"
brew "nvim"
brew "openssl"
brew "parallel"                                   # Build and execute shell command lines from standard input in parallel - https://www.gnu.org/software/parallel/man.html
brew "pass"                                       # open source password manager • including iOS app • syncing via git repo • encryption using GPG
brew "peco"                                       # It’s a interactive filtering tool.
brew "p0f"
brew "pngquant"                                   # Lossy PNG compressor
brew "poppler"                                    # Necessary for pdfinfo command
brew "powerlevel10k"                              # Blazing fast theme for ZSH
brew "pstree"
brew "rbenv"
brew "rga"                                        # 🔥 rga: ripgrep, but also search in PDFs, E-Books, Office documents, zip, tar.gz, etc.
brew "ripgrep"                                    # ripgrep recursively searches directories for a regex pattern while respecting your gitignore
brew "sentry-cli"                                 # A command line utility to work with Sentry.
brew "shellcheck"                                 # 🔥 static analysis tool for shell scripts
brew "spotify-tui"                                # Spotify for the terminal written in Rust 🚀
brew "sshs"                                       # Terminal user interface for SSH
brew "task"                                       # Command line Task Management
brew "tasksh"                                     # Shell wrapper for Taskwarrior commands
brew "timewarrior"
brew "terraform"                                  # Terraform enables you to safely and predictably create, change, and improve infrastructure. It is a source-available tool that codifies APIs into declarative configuration files that can be shared amongst team members, treated as code, edited, reviewed, and versioned.
# brew "tealdeer"                                   # 🔥 Collaborative cheatsheets for console commands • DEPRECATED: Use tlrc instead as recommended on official tlrc page
brew "tmux"
brew "tlrc"                                       # 🔥 Collaborative cheatsheets for console commands
brew "tpm"                                        # Tmux plugin mnager
brew "transcrypt"                                 # used to transparently de-/encrypt the repo ios-keystore
brew "tree"                                       # useful to print whole directory hierarchies while debugging
brew "watch"
brew "wget"
brew "xcodes"                                     # The best CLI to install and switch between multiple versions of Xcode.
brew "xcparse"                                    # Command line tool & Swift framework for parsing Xcode 11+ xcresult
brew "yt-dlp"
brew "zsh-completions"                            # Additional completion definitions for Zsh
brew "zoxide"                                     # A smarter cd command, inspired by z and autojump.

# tap "1password"                                 # this installs the pricy 1password 7
cask "adobe-creative-cloud"
cask "aware"                                      # Menubar app for macOS that displays how long you've been actively using your computer.
# cask "background-music"                           # 🔥 Control audio per-app - nice for muting teams and just look at the video •••• did not find out how to enable microphone
cask "battle-net"
cask "brisk"                                      # submitting radars
cask "cyberduck"                                  # FTP / Dropbox client 
cask "deckset"
cask "docker"                                     # 🔥
cask "dropbox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-microsoft-office"
cask "font-source-code-pro"
cask "fork"                                       # a fast and friendly git client
cask "geektool"
cask "google-chrome"                              # 🔥 Doesn't work correctly with 1password
cask "gpg-suite-no-mail"                          # 🔥
cask "grandperspective"                           # Disk usage analyzer
cask "handbrake"
cask "iina"
cask "inkscape"
cask "insomnia"                                   # 🔥 Open-source, cross-platform API client for GraphQL, REST, WebSockets and gRPC.
cask "iterm2"                                     # 🔥
cask "karabiner-elements"                         # 🔥
cask "keepassxc"
cask "keycastr"                                   # KeyCastr, an open-source keystroke visualizer
cask "linkliar"                                   # Link-Layer MAC spoofing GUI for macOS
cask "netnewswire"
cask "obsidian"                                   # Obsidian is a personal knowledge base and note-taking software application that operates on Markdown files.
cask "openra"                                     # 🔥 C&C open source
cask "periphery"                                  # A tool to identify unused code in Swift projects.
cask "portfolioperformance"                       # Depot tracking
cask "provisionql"
cask "qlstephen"
cask "raspberry-pi-imager"
cask "raycast"                                    # Drop in sulution for macOS Spotlight
cask "scummvm"
cask "sf-symbols"                                 # 🔥
cask "signal"                                     # A secure messenger
cask "sketch"
# cask "skype"                                    # not used
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "swift-quit"
cask "swiftformat-for-xcode"
cask "syntax-highlight"
cask "telegram"
# cask "texshop"                                  # switched off since quite big - re-enable when needed
cask "tunnelblick"
# cask "visual-studio-code"
cask "vlc"
cask "wireshark"
# cask "wwdc"
cask "xcodes"

mas "Unsplash Wallpapers", id: 1284863847

# vim: ft=bash