# Example
#
# tap "homebrew/cask"
# tap "telemachus/brew", "https://telemachus@bitbucket.org/telemachus/brew.git", pin: true
# brew "imagemagick"
# brew "mysql@5.6", restart_service: true, link: true, conflicts_with: ["mysql"]
# brew "emacs", args: ["with-cocoa", "with-gnutls"]
# cask "google-chrome"
# cask "java" unless system "/usr/libexec/java_home --failfast"
# cask "firefox", args: { appdir: "~/my-apps/Applications" }
# mas "1Password", id: 443987910

tap "jzaleski/homebrew-jzaleski" # support for apg
tap "lokalise/cli-2"
tap "homebrew/cask-fonts" # support for fonts
tap "colindean/fonts-nonfree" # Calibri, Cambria, ...
tap "github/gh" # Github CLI
tap "romkatv/powerlevel10k"
tap "Blackjacx/homebrew-formulae" # App Store Connect API client written in Swift

# Xcode first since it is required by applications below, e.g. xcparse
# mas "xcode", id: 497799835 # This will download Xcode even if it is installed - which takes a lot of time
# mas "tweetbot", id: 557168941
# mas "gifski", id: 1351639930

brew "ag" # code-searching tool similar to ack, but faster 🔥
brew "apg" # generate strong passwords
brew "aria2" # download manager that supports segmented downloads 🔥
brew "asc" # App Store Connect API client written in Swift
#brew "atuin"                                     # SQLlite history plugin
brew "bitwarden-cli" # Fully-featured tool for accessing and managing your Bitwarden Vault • Used to auto-export credentials
brew "btop"                                       # 🔥 A monitor of resources
brew "ccat" #  🔥 Colorizing cat
brew "chargepoint/xcparse/xcparse" # extract screenshots from Xcode 11 xcresult bundle
brew "cloc" # lines of code counter
brew "coreutils"
brew "curl"
brew "direnv"                                     # 🔥
brew "doxygen"
brew "entr"                                       # Run arbitrary commands when files change
brew "exa"                                        # Modern `ls` replacement
brew "fd"                                         # Drop in replacement for find
brew "ffmpeg"
brew "figlet"                                     # making large letters out of ordinary text
brew "firebase-cli"                               # automating Firebase
brew "fzf"                                        # A command-line fuzzy finder 🔥
brew "fx"                                         # Interactive terminal JSON viewer & processor  🔥
brew "gh"
brew "ghostscript" # needed inconjunction with imagemagick to convert pdf > png (conversion of PDF app icons from UX to PNG automatically)
brew "git" # distributed version-control system for tracking changes in source code during software development
brew "git-extras"
brew "git-flow"
brew "github-markdown-toc"
brew "gource" # software version control visualization
brew "htop"
brew "httpie"
brew "imagemagick"
brew "irssi"
brew "jq" # command-line JSON processor 🔥
brew "lokalise2" # tool for for mobile localization cloud platform (new version)
brew "mas" # installs Mac App Store apps
brew "micro" # A modern and intuitive terminal-based text editor
brew "mint" # dependency manager for swift packages 🔥
brew "mitmproxy" # Intercepting Network Traffic 🔥
# brew "mplayer" # free and open-source media player | currently not used
brew "nano"
brew "ncdu"                                       # Disk usage analyzer
brew "neofetch"                                   # A CLI system information tool
brew "node"
brew "npm"
brew "nvim"
brew "openssl"
brew "pass" # open source password manager • including iOS app • syncing via git repo • encryption using GPG
brew "peco" # It’s a interactive filtering tool.
brew "p0f"
brew "pngquant" # Lossy PNG compressor
brew "poppler"                                    # Necessary for pdfinfo command
brew "powerlevel10k"                              # Blazing fast theme for ZSH
brew "pstree"
brew "rbenv"
brew "rga"                                        # 🔥 rga: ripgrep, but also search in PDFs, E-Books, Office documents, zip, tar.gz, etc.
brew "ripgrep"                                    # ripgrep recursively searches directories for a regex pattern while respecting your gitignore
brew "shellcheck"                                 # 🔥 static analysis tool for shell scripts
brew "task"                                       # Command line Task Management
brew "tasksh"                                     # Shell wrapper for Taskwarrior commands
brew "timewarrior"
brew "tmux"
brew "tpm"                                        # Tmux plugin mnager
brew "transcrypt"                                 # used to transparently de-/encrypt the repo ios-keystore
brew "tree"
brew "watch"
brew "wget"
brew "xcodesorg/made/xcodes"                      # The best command-line tool to install and switch between multiple versions of Xcode.
brew "youtube-dl"
brew "zsh-completions"                            # Additional completion definitions for Zsh
brew "zsh-syntax-highlighting"                    # Fish shell like syntax highlighting for Zsh.
brew "zoxide"                                     # A smarter cd command, inspired by z and autojump.

# tap "1password" # this installs the pricy 1password 7
cask "adobe-creative-cloud"
cask "aerial" # phenomenal screen saver with tons of options
cask "aware" # Menubar app for macOS that displays how long you've been actively using your computer.
cask "brisk" # submitting radars
cask "cyberduck" # FTP / Dropbox client 
cask "deckset"
cask "docker" # 🔥
cask "dropbox"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-microsoft-office"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "geektool"
cask "gpg-suite-no-mail" # 🔥
cask "google-chrome"                              # Doesn't work correctly with 1password 🚨
cask "handbrake"
cask "iina"
cask "inkscape"
cask "insomnia"                                   # Open-source, cross-platform API client for GraphQL, REST, WebSockets and gRPC. 🔥
cask "iterm2"                                     # 🔥
cask "karabiner-elements"                         # 🔥
cask "keepassxc"
cask "keycastr"                                   # KeyCastr, an open-source keystroke visualizer
cask "linkliar"                                   # Link-Layer MAC spoofing GUI for macOS
cask "openra"                                     # C&C open source 🔥
cask "provisionql"
cask "scummvm"
cask "sf-symbols"                                 # 🔥
cask "sketch"
# cask "skype"                                    # not used
cask "slack"
cask "spectacle"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "telegram"
# cask "texshop"                                  # switched off since quite big - re-enable when needed
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "wwdc"
cask "xcodes"