# Example
#
# tap "homebrew/cask"
# tap "telemachus/brew", "https://telemachus@bitbucket.org/telemachus/brew.git", pin: true
# brew "imagemagick"
# brew "mysql@5.6", restart_service: true, link: true, conflicts_with: ["mysql"]
# brew "emacs", args: ["with-cocoa", "with-gnutls"]
# cask "google-chrome"
# cask "java" unless system "/usr/libexec/java_home --failfast"
# cask "firefox", args: { appdir: "~/my-apps/Applications" }
# mas "1Password", id: 443987910

tap "jzaleski/homebrew-jzaleski"                  # support for apg
tap "lokalise/cli-2"
tap "homebrew/cask-fonts"                         # support for fonts
tap "colindean/fonts-nonfree"                     # Calibri, Cambria, ...
tap "github/gh"                                   # support for gh • Github CLI
tap "romkatv/powerlevel10k"
tap "Blackjacx/homebrew-formulae"                 # support for asc • App Store Connect API client written in Swift
tap "getsentry/tools"                             # to install sentry CLI
tap "chargepoint/xcparse"                         # to install xcparse
tap "peripheryapp/periphery"                      # to install periphery
tap "julien-cpsn/atac"                            # to install atag
tap "jesseduffield/lazygit"                       # to install lazygit

# Xcode first since it is required by applications below, e.g. xcparse
# mas "xcode", id: 497799835 # This will download Xcode even if it is installed - which takes a lot of time
# mas "tweetbot", id: 557168941
# mas "gifski", id: 1351639930

brew "git-absorb"                                 # 🔥 git commit --fixup, but automatic
brew "ag"                                         # 🔥 code-searching tool similar to ack, but faster
brew "alacritty"                                  # a cross-platform, OpenGL terminal emulator.
brew "apg"                                        # generate strong passwords
brew "aria2"                                      # 🔥 download manager that supports segmented downloads
brew "asc"                                        # App Store Connect API client written in Swift
brew "asciinema"                                  # terminal session recorder
brew "atac"                                       # a simple API client (postman like) in your terminal
#brew "atuin"                                     # SQLlite history plugin
brew "awscli"                                     # the command line frontend for Amazon Web Services
brew "bash"                                       # the bash shell
brew "basictex"                                   # BasicTeX is a subset of TeX Live of size 110 megabytes instead of 2 gigabytes.
brew "bat"                                        # a cat clone with wings.
brew "bitwarden-cli"                              # fully-featured tool for accessing and managing your Bitwarden Vault • Used to auto-export credentials
brew "btop"                                       # 🔥 a monitor of resources
brew "cloc"                                       # lines of code counter
brew "cmatrix"                                    # terminal based "The Matrix" like implementation
brew "coreutils"
brew "curl"
brew "direnv"                                     # 🔥 .envrc file loader
brew "diskonaut"                                  # Terminal disk space navigator 🔭
brew "dotenv-linter"                              # env file linter used in neovim
brew "doxygen"
brew "entr"                                       # run arbitrary commands when files change
brew "eza"                                        # modern `ls` ... replacement
brew "fastfetch"                                  # feature-rich and performance oriented, system information tool.
brew "fd"                                         # drop in replacement for find
brew "ffmpeg"
brew "figlet"                                     # making large letters out of ordinary text
brew "firebase-cli"                               # automating Firebase
brew "fx"                                         # 🔥 interactive terminal JSON viewer & processor
# brew "fzf"                                        # a command-line fuzzy finder (installed using "mise en place")
brew "gh"
brew "ghostscript"                                # needed inconjunction with imagemagick to convert pdf > png (conversion of PDF app icons from UX to PNG automatically)
brew "git"                                        # distributed version-control system for tracking changes in source code during software development
brew "git-delta"                                  # A syntax-highlighting pager for git, diff, grep, and blame output
brew "git-extras"
brew "git-flow"
brew "github-markdown-toc"
brew "gource"                                     # software version control visualization
brew "htop"
brew "httpie"
brew "hub"                                        # A command-line tool that makes git easier to use with GitHub.
brew "imagemagick"                                # use ImageMagick® to create, edit, compose, or convert digital images.
brew "irssi"
brew "lazygit"                                    # simple terminal UI for git commands
brew "lokalise2"                                  # tool for for mobile localization cloud platform (new version)
brew "mas"                                        # installs Mac App Store apps
brew "midnight-commander"
brew "mint"                                       # 🔥 dependency manager for swift packages
brew "mitmproxy"                                  # 🔥 intercepting Network Traffic
# brew "mplayer"                                  # free and open-source media player | currently not used
brew "nano"
brew "ncdu"                                       # disk usage analyzer
brew "nmap"                                       # "Network Mapper" is an open source tool for network exploration and security auditing.
brew "node"
brew "npm"
brew "nvim"
brew "openssl"
brew "parallel"                                   # build and execute shell command lines from standard input in parallel - https://www.gnu.org/software/parallel/man.html
brew "pass"                                       # open source password manager • including iOS app • syncing via git repo • encryption using GPG
brew "pastel"                                     # tool to generate, analyze, convert and manipulate colors 
brew "peco"                                       # it’s a interactive filtering tool.
brew "p0f"
brew "pngquant"                                   # lossy PNG compressor
brew "poppler"                                    # necessary for pdfinfo command
brew "powerlevel10k"                              # blazing fast theme for ZSH
brew "pstree"
brew "rbenv"
brew "rga"                                        # 🔥 rga: ripgrep, but also search in PDFs, E-Books, Office documents, zip, tar.gz, etc.
brew "ripgrep"                                    # ripgrep recursively searches directories for a regex pattern while respecting your gitignore
brew "sentry-cli"                                 # a command line utility to work with Sentry.
brew "shellcheck"                                 # 🔥 static analysis tool for shell scripts
brew "spotify-tui"                                # spotify for the terminal written in Rust 🚀
brew "sshs"                                       # terminal user interface for SSH
brew "task"                                       # command line Task Management
brew "tasksh"                                     # shell wrapper for Taskwarrior commands
brew "timewarrior"
brew "terraform"                                  # terraform enables you to safely and predictably create, change, and improve infrastructure. It is a source-available tool that codifies APIs into declarative configuration files that can be shared amongst team members, treated as code, edited, reviewed, and versioned.
brew "tex-live-utility"                           # graphical interface for TeX Live Manager, which is a tool to update and maintain TeX Live
# brew "tealdeer"                                   # 🔥 collaborative cheatsheets for console commands • DEPRECATED: Use tlrc instead as recommended on official tlrc page
brew "tmux"
brew "tlrc"                                       # 🔥 collaborative cheatsheets for console commands
brew "tpm"                                        # tmux plugin mnager
brew "transcrypt"                                 # used to transparently de-/encrypt the repo ios-keystore
brew "tree"                                       # useful to print whole directory hierarchies while debugging
brew "watch"
brew "wget"
brew "xcodes"                                     # the best CLI to install and switch between multiple versions of Xcode.
brew "xcparse"                                    # command line tool & Swift framework for parsing Xcode 11+ xcresult
brew "yt-dlp"
brew "zsh-completions"                            # additional completion definitions for Zsh
brew "zoxide"                                     # a smarter cd command, inspired by z and autojump.

cask "adobe-creative-cloud"
cask "basictex"                                   # Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "battle-net"
cask "blackhole-64ch"                             # Modern macOS audio loopback driver that allows applications to pass audio to other applications with zero additional latency.
cask "brisk"                                      # submitting radars
cask "cyberduck"                                  # ftp / Dropbox client
cask "deckset"
# cask "docker"                                     # 🔥 - quite big, re-enable when needed
cask "dropbox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-microsoft-office"
cask "font-source-code-pro"
# cask "fork"                                     # a fast and friendly git client
cask "ghostty"                                    # Fast, feature-rich, cross-platform terminal emulator using platform-native UI and GPU acceleration.
cask "github-copilot-for-xcode"                   # Xcode extension for GitHub Copilot
cask "google-chrome"                              # 🔥 doesn't work correctly with 1password
cask "gpg-suite-no-mail"                          # 🔥
# cask "grandperspective"                         # disk usage analyzer - I prefer the CLI diskonaut
cask "handbrake"
cask "iina"
cask "inkscape"
cask "insomnia"                                   # 🔥 open-source, cross-platform API client for GraphQL, REST, WebSockets and gRPC.
cask "karabiner-elements"                         # 🔥
cask "keepassxc"
cask "keycastr"                                   # open-source keystroke visualizer
cask "linkliar"                                   # link-Layer MAC spoofing GUI for macOS
cask "logi-options+"                              # Config app for Logitech devices
cask "netnewswire"
cask "obsidian"                                   # obsidian is a personal knowledge base and note-taking software application that operates on Markdown files.
cask "openra"                                     # 🔥 C&C open source
cask "periphery"                                  # a tool to identify unused code in Swift projects.
cask "portfolioperformance"                       # depot tracking
cask "provisionql"
cask "qlstephen"
cask "raspberry-pi-imager"
cask "raycast"                                    # drop in sulution for macOS Spotlight
cask "scummvm"
cask "sf-symbols"                                 # 🔥
cask "signal"                                     # secure messenger
cask "sketch"
# cask "skype"                                    # will be removed from MS world soon - replaced by teams
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "supercollider"                              # An audio server, programming language, and IDE for sound synthesis and algorithmic composition.
cask "swiftformat-for-xcode"
cask "syntax-highlight"
cask "telegram"
cask "tex-live-utility"                           # TeX Live Utility, a Mac OS GUI for the TeX Live Manager
# cask "texshop"                                  # switched off since quite big - re-enable when needed
cask "tunnelblick"
# cask "visual-studio-code"
cask "vlc"
cask "wireshark"
# cask "wwdc"

mas "Unsplash Wallpapers", id: 1284863847
mas "Aware", id: 1082170746                       # menubar app for macOS that displays how long you've been actively using your computer.

